; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p13---int100n150-m25---int100c200---s272---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level11 level11)
(sum level0 level17 level17)
(sum level0 level24 level24)
(sum level1 level4 level5)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level11 level12)
(sum level1 level17 level18)
(sum level1 level24 level25)
(sum level2 level4 level6)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level11 level13)
(sum level2 level17 level19)
(sum level2 level24 level26)
(sum level3 level4 level7)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level11 level14)
(sum level3 level17 level20)
(sum level3 level24 level27)
(sum level4 level4 level8)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level11 level15)
(sum level4 level17 level21)
(sum level4 level24 level28)
(sum level5 level4 level9)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level11 level16)
(sum level5 level17 level22)
(sum level5 level24 level29)
(sum level6 level4 level10)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level11 level17)
(sum level6 level17 level23)
(sum level6 level24 level30)
(sum level7 level4 level11)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level11 level18)
(sum level7 level17 level24)
(sum level7 level24 level31)
(sum level8 level4 level12)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level11 level19)
(sum level8 level17 level25)
(sum level8 level24 level32)
(sum level9 level4 level13)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level11 level20)
(sum level9 level17 level26)
(sum level9 level24 level33)
(sum level10 level4 level14)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level11 level21)
(sum level10 level17 level27)
(sum level10 level24 level34)
(sum level11 level4 level15)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level11 level22)
(sum level11 level17 level28)
(sum level11 level24 level35)
(sum level12 level4 level16)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level11 level23)
(sum level12 level17 level29)
(sum level12 level24 level36)
(sum level13 level4 level17)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level11 level24)
(sum level13 level17 level30)
(sum level13 level24 level37)
(sum level14 level4 level18)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level11 level25)
(sum level14 level17 level31)
(sum level14 level24 level38)
(sum level15 level4 level19)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level11 level26)
(sum level15 level17 level32)
(sum level15 level24 level39)
(sum level16 level4 level20)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level11 level27)
(sum level16 level17 level33)
(sum level16 level24 level40)
(sum level17 level4 level21)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level11 level28)
(sum level17 level17 level34)
(sum level17 level24 level41)
(sum level18 level4 level22)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level11 level29)
(sum level18 level17 level35)
(sum level18 level24 level42)
(sum level19 level4 level23)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level11 level30)
(sum level19 level17 level36)
(sum level19 level24 level43)
(sum level20 level4 level24)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level11 level31)
(sum level20 level17 level37)
(sum level20 level24 level44)
(sum level21 level4 level25)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level11 level32)
(sum level21 level17 level38)
(sum level21 level24 level45)
(sum level22 level4 level26)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level11 level33)
(sum level22 level17 level39)
(sum level22 level24 level46)
(sum level23 level4 level27)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level11 level34)
(sum level23 level17 level40)
(sum level23 level24 level47)
(sum level24 level4 level28)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level11 level35)
(sum level24 level17 level41)
(sum level24 level24 level48)
(sum level25 level4 level29)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level11 level36)
(sum level25 level17 level42)
(sum level25 level24 level49)
(sum level26 level4 level30)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level11 level37)
(sum level26 level17 level43)
(sum level26 level24 level50)
(sum level27 level4 level31)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level11 level38)
(sum level27 level17 level44)
(sum level27 level24 level51)
(sum level28 level4 level32)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level11 level39)
(sum level28 level17 level45)
(sum level28 level24 level52)
(sum level29 level4 level33)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level11 level40)
(sum level29 level17 level46)
(sum level29 level24 level53)
(sum level30 level4 level34)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level11 level41)
(sum level30 level17 level47)
(sum level30 level24 level54)
(sum level31 level4 level35)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level11 level42)
(sum level31 level17 level48)
(sum level31 level24 level55)
(sum level32 level4 level36)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level11 level43)
(sum level32 level17 level49)
(sum level32 level24 level56)
(sum level33 level4 level37)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level11 level44)
(sum level33 level17 level50)
(sum level33 level24 level57)
(sum level34 level4 level38)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level11 level45)
(sum level34 level17 level51)
(sum level34 level24 level58)
(sum level35 level4 level39)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level11 level46)
(sum level35 level17 level52)
(sum level35 level24 level59)
(sum level36 level4 level40)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level11 level47)
(sum level36 level17 level53)
(sum level36 level24 level60)
(sum level37 level4 level41)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level11 level48)
(sum level37 level17 level54)
(sum level37 level24 level61)
(sum level38 level4 level42)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level11 level49)
(sum level38 level17 level55)
(sum level38 level24 level62)
(sum level39 level4 level43)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level39 level11 level50)
(sum level39 level17 level56)
(sum level39 level24 level63)
(sum level40 level4 level44)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level40 level11 level51)
(sum level40 level17 level57)
(sum level40 level24 level64)
(sum level41 level4 level45)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level41 level11 level52)
(sum level41 level17 level58)
(sum level41 level24 level65)
(sum level42 level4 level46)
(sum level42 level6 level48)
(sum level42 level7 level49)
(sum level42 level11 level53)
(sum level42 level17 level59)
(sum level42 level24 level66)
(sum level43 level4 level47)
(sum level43 level6 level49)
(sum level43 level7 level50)
(sum level43 level11 level54)
(sum level43 level17 level60)
(sum level43 level24 level67)
(sum level44 level4 level48)
(sum level44 level6 level50)
(sum level44 level7 level51)
(sum level44 level11 level55)
(sum level44 level17 level61)
(sum level44 level24 level68)
(sum level45 level4 level49)
(sum level45 level6 level51)
(sum level45 level7 level52)
(sum level45 level11 level56)
(sum level45 level17 level62)
(sum level46 level4 level50)
(sum level46 level6 level52)
(sum level46 level7 level53)
(sum level46 level11 level57)
(sum level46 level17 level63)
(sum level47 level4 level51)
(sum level47 level6 level53)
(sum level47 level7 level54)
(sum level47 level11 level58)
(sum level47 level17 level64)
(sum level48 level4 level52)
(sum level48 level6 level54)
(sum level48 level7 level55)
(sum level48 level11 level59)
(sum level48 level17 level65)
(sum level49 level4 level53)
(sum level49 level6 level55)
(sum level49 level7 level56)
(sum level49 level11 level60)
(sum level49 level17 level66)
(sum level50 level4 level54)
(sum level50 level6 level56)
(sum level50 level7 level57)
(sum level50 level11 level61)
(sum level50 level17 level67)
(sum level51 level4 level55)
(sum level51 level6 level57)
(sum level51 level7 level58)
(sum level51 level11 level62)
(sum level51 level17 level68)
(sum level52 level4 level56)
(sum level52 level6 level58)
(sum level52 level7 level59)
(sum level52 level11 level63)
(sum level53 level4 level57)
(sum level53 level6 level59)
(sum level53 level7 level60)
(sum level53 level11 level64)
(sum level54 level4 level58)
(sum level54 level6 level60)
(sum level54 level7 level61)
(sum level54 level11 level65)
(sum level55 level4 level59)
(sum level55 level6 level61)
(sum level55 level7 level62)
(sum level55 level11 level66)
(sum level56 level4 level60)
(sum level56 level6 level62)
(sum level56 level7 level63)
(sum level56 level11 level67)
(sum level57 level4 level61)
(sum level57 level6 level63)
(sum level57 level7 level64)
(sum level57 level11 level68)
(sum level58 level4 level62)
(sum level58 level6 level64)
(sum level58 level7 level65)
(sum level59 level4 level63)
(sum level59 level6 level65)
(sum level59 level7 level66)
(sum level60 level4 level64)
(sum level60 level6 level66)
(sum level60 level7 level67)
(sum level61 level4 level65)
(sum level61 level6 level67)
(sum level61 level7 level68)
(sum level62 level4 level66)
(sum level62 level6 level68)
(sum level63 level4 level67)
(sum level64 level4 level68)

(connected l0 l1)
(fuelcost level7 l0 l1)
(connected l0 l2)
(fuelcost level4 l0 l2)
(connected l0 l3)
(fuelcost level6 l0 l3)
(connected l1 l0)
(fuelcost level7 l1 l0)
(connected l1 l2)
(fuelcost level24 l1 l2)
(connected l1 l3)
(fuelcost level17 l1 l3)
(connected l2 l0)
(fuelcost level4 l2 l0)
(connected l2 l1)
(fuelcost level24 l2 l1)
(connected l2 l3)
(fuelcost level11 l2 l3)
(connected l3 l0)
(fuelcost level6 l3 l0)
(connected l3 l1)
(fuelcost level17 l3 l1)
(connected l3 l2)
(fuelcost level11 l3 l2)

(at t0 l1)
(fuel t0 level68)
(= (total-cost) 0)

(at p0 l1)
(at p1 l0)
(at p2 l0)
(at p3 l3)
(at p4 l0)
(at p5 l0)
(at p6 l2)
(at p7 l3)
(at p8 l1)
(at p9 l1)
(at p10 l0)
(at p11 l0)
(at p12 l2)
)

(:goal
(and
(at p0 l3)
(at p1 l1)
(at p2 l3)
(at p3 l1)
(at p4 l1)
(at p5 l1)
(at p6 l3)
(at p7 l1)
(at p8 l0)
(at p9 l2)
(at p10 l3)
(at p11 l1)
(at p12 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 0 of 13
2. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 0 of 13
3. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 13
4. (drive t0 l1 l2 level44 level24 level68)
   deleted: (at t0 l1) (fuel t0 level68)
   added: (at t0 l2) (fuel t0 level44)
   goals met: 0 of 13
5. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 1 of 13
6. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 1 of 13
7. (load p12 t0 l2)
   deleted: (at p12 l2)
   added: (in p12 t0)
   goals met: 1 of 13
8. (drive t0 l2 l0 level40 level4 level44)
   deleted: (at t0 l2) (fuel t0 level44)
   added: (at t0 l0) (fuel t0 level40)
   goals met: 1 of 13
9. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 2 of 13
10. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 2 of 13
11. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 2 of 13
12. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 2 of 13
13. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 2 of 13
14. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 2 of 13
15. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 2 of 13
16. (drive t0 l0 l3 level34 level6 level40)
   deleted: (at t0 l0) (fuel t0 level40)
   added: (at t0 l3) (fuel t0 level34)
   goals met: 2 of 13
17. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 3 of 13
18. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 3 of 13
19. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 3 of 13
20. (unload p10 t0 l3)
   deleted: (in p10 t0)
   added: (at p10 l3)
   goals met: 4 of 13
21. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 5 of 13
22. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 6 of 13
23. (drive t0 l3 l1 level17 level17 level34)
   deleted: (at t0 l3) (fuel t0 level34)
   added: (at t0 l1) (fuel t0 level17)
   goals met: 6 of 13
24. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 7 of 13
25. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 8 of 13
26. (unload p12 t0 l1)
   deleted: (in p12 t0)
   added: (at p12 l1)
   goals met: 9 of 13
27. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 10 of 13
28. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 11 of 13
29. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 12 of 13
30. (unload p7 t0 l1)
   deleted: (in p7 t0)
   added: (at p7 l1)
   goals met: 13 of 13
